xmlsamples/PI_MTCN/KR-SMS-BIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <ns2:esp-send-money-store-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <partner>
            <id>WGBSKR3730T</id>
            <system>
               <id>Demo</id>
               <name>Demo</name>
               <version>9101</version>
               <ip_address>172.31.19.212</ip_address>
               <connector>
                  <id>KR373EWP001A</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>BC</id>
            <type>DMAMOB</type>
         </device>
         <external_reference_no>1232</external_reference_no>
         <sender>
            <name>
               <first_name>KYEONGMIN</first_name>
               <last_name>LEE</last_name>
            </name>
            <address>
               <country_iso_code>SA</country_iso_code>
            </address>
            <compliance_details>
               <template_id>INT_06_S</template_id>
               <id_documents>
                  <id_document>
                     <type>A</type>
                     <data>A222221111</data>
                     <issue_country>
                        <country_name>Korea</country_name>
                     </issue_country>
                     <expiration_date>30122026</expiration_date>
                     <id_expires>true</id_expires>
                  </id_document>
               </id_documents>
               <date_of_birth>30121986</date_of_birth>
               <Country_of_Birth>KOREA</Country_of_Birth>
               <ack_flag>X</ack_flag>
            </compliance_details>
            <contact_phone>8201095991874</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>82</country_code>
                  <national_number>01095991874</national_number>
               </phone_number>
            </mobile_phone>
            <home_phone>
               <city_code>82</city_code>
               <number>01095991874</number>
            </home_phone>
            <bank_account>
               <name>Hanpass</name>
               <account_number>01095991874</account_number>
            </bank_account>
         </sender>
         <receiver>
            <name>
               <first_name>AADIL</first_name>
               <last_name>KATTEKAR</last_name>
            </name>
         </receiver>
         <wu_product>
            <name>MONEY IN MINUTES</name>
            <code>000</code>
         </wu_product>
         <transaction_type>WMF</transaction_type>
         <payment_details>
            <origination>
               <principal_amount>20</principal_amount>
               <gross_amount>220</gross_amount>
               <currency_iso_code>USD</currency_iso_code>
               <country_iso_code>KR</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>1000</expected_payout_amount>
               <currency_iso_code>PHP</currency_iso_code>
               <country_iso_code>PH</country_iso_code>
            </destination>
            <promotion>
               <name/>
               <code>-</code>
               <description/>
               <discount>0</discount>
               <message/>
            </promotion>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <fees>
               <base_charges>200</base_charges>
               <delivery_charges>0</delivery_charges>
               <other_charges>0</other_charges>
            </fees>
            <exchange_rate>50.1828249</exchange_rate>
            <identification_question/>
         </payment_details>
         <temp_transaction_id>2013000809067998</temp_transaction_id>
         <transaction_digest>45C94CCF22CC637665039447E97B30F47578A2EF</transaction_digest>
      </ns2:esp-send-money-store-request>
   </soapenv:Body>
</soapenv:Envelope>